In [1]:
import pandas as pd
import numpy as np

In [3]:
weatherDict = {"Istanbul":[30,29,np.nan],
"Ankara":[20,np.nan,25],
"Izmir":[40,39,38]}
weatherDF = pd.DataFrame(weatherDict,index=["Pazartesi","Sali","Carsamba"] )
weatherDF

           Istanbul  Ankara  Izmir
Pazartesi      30.0    20.0     40
Sali           29.0     NaN     39
Carsamba        NaN    25.0     38

In [4]:
weatherDF.dropna()

           Istanbul  Ankara  Izmir
Pazartesi      30.0    20.0     40

In [5]:
weatherDF.dropna( axis=1)

           Izmir
Pazartesi     40
Sali          39
Carsamba      38

In [7]:
weatherDict2 = {"Istanbul":[30,29,np.nan],
"Ankara":[20,np.nan,25],
"Izmir":[40,39,38],
"Antalya":[33,np.nan,np.nan]}
weatherDF2 = pd.DataFrame(weatherDict2,index=["Pazartesi","Sali","Carsamba"] )
weatherDF2

           Istanbul  Ankara  Izmir  Antalya
Pazartesi      30.0    20.0     40     33.0
Sali           29.0     NaN     39      NaN
Carsamba        NaN    25.0     38      NaN

In [15]:
weatherDF2.dropna(axis=1, thresh=2)

           Istanbul  Ankara  Izmir
Pazartesi      30.0    20.0     40
Sali           29.0     NaN     39
Carsamba        NaN    25.0     38

In [16]:
weatherDF2.fillna(20)

           Istanbul  Ankara  Izmir  Antalya
Pazartesi      30.0    20.0     40     33.0
Sali           29.0    20.0     39     20.0
Carsamba       20.0    25.0     38     20.0

## group by method

In [24]:
salaryDict =  {"Departman":["Yazılım","Yazılım","Hukuk","Hukuk"],"names":["Ahmet","Mehmet","Veli","Ali"],"Salary":[300,200,100,500]}
salaryDF = pd.DataFrame(salaryDict)

In [25]:
salaryDF

  Departman   names  Salary
0   Yazılım   Ahmet     300
1   Yazılım  Mehmet     200
2     Hukuk    Veli     100
3     Hukuk     Ali     500

In [26]:
gropByObject = salaryDF.groupby("Departman")

In [27]:
gropByObject

In [28]:
gropByObject.count()

           names  Salary
Departman
Hukuk          2       2
Yazılım        2       2

In [29]:
gropByObject.mean()

/var/folders/km/71_5yjw57z599vm55s1kjzc00000gn/T/ipykernel_1669/3835519569.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gropByObject.mean()

           Salary
Departman
Hukuk       300.0
Yazılım     250.0

In [30]:
gropByObject.max()

            names  Salary
Departman
Hukuk        Veli     500
Yazılım    Mehmet     300

In [31]:
gropByObject.min()

           names  Salary
Departman
Hukuk        Ali     100
Yazılım    Ahmet     200

In [32]:
gropByObject.describe()

          Salary
           count   mean         std    min    25%    50%    75%    max
Departman
Hukuk        2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0
Yazılım      2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0